"---------------------------------------------------------------------------
"一般共通設定
"---------------------------------------------------------------------------
set nocompatible "viと非互換に
set number "行番号表示
set showmode "モード表示
set visualbell "ビープ音防止
set noswapfile "スワップファイルは要らない
"ファイルを開いた際に、前回終了時の行で起動
autocmd BufReadPost * if line("'\"") > 0 && line("'\"") <= line("$") | exe "normal g`\"" | endif

"---------------------------------------------------------------------------
"検索系設定
"---------------------------------------------------------------------------
set ignorecase "検索文字が小文字の場合は、小文字大文字区別なく検索
set smartcase "検索文字が大文字の場合はは区別して検索
set wrapscan "検索が最後までいったら頭へ戻る
" ESCを2回入力で検索時のハイライトを解除
nnoremap <ESC><ESC> :nohlsearch<CR>

"---------------------------------------------------------------------------
"プログラミング系設定
"---------------------------------------------------------------------------
syntax on "文法をカラー表示
set smartindent "オートインデント
set expandtab "タブをスペースへ展開
set ts=2 sw=2 sts=0 "タブを半角スペース2文字へ

"---------------------------------------------------------------------------
"エンコーディング
"---------------------------------------------------------------------------
set termencoding=utf-8
set encoding=utf-8
set fileencodings=iso-2022-jp,utf-8,cp932,euc-jp
